Revit 2027 API
ExternalResourceReference.GetReferenceInformation Method
 Returns a copy of an object containing previously-stored reference or lookup information about the specific resource provided by the server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetReferenceInformation()
Public Function GetReferenceInformation As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetReferenceInformation()
member GetReferenceInformation : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
 A copy of a (String, String) map containing previously-stored reference or lookup information.
See Also
Reference
ExternalResourceReference Class
Autodesk.Revit.DB Namespace